from aiogram import Router, types
from aiogram.filters import Command
from aiogram.types import Message

router = Router()

@router.message(Command("about"))
async def about_command(message: Message):
    await message.answer(
        "🧻‌ *درباره ربات پیدا کردن دستشویی!*\n\n"
        "سلام رفیق! 👋\n"
        "به رباتی قدم گذاشتی که با هدف حل یکی از دردناک‌ترین بحران‌های لحظه‌ای ساخته شده: «کجا برم دستشویی؟!» 😅\n\n"
        "ما این ربات رو ساختیم تا هرجا که هستی، بتونی سریع‌ترین و نزدیک‌ترین دستشویی رو پیدا کنی. "
        "تو خیابون، پارک، مرکز خرید یا هرجای دیگه… فقط موقعیتت رو بفرست، بقیه‌ش با ما! 🚀\n\n"
        "✨ چی باعث میشه این ربات بهتر کار کنه؟ مشارکت شما!\n"
        "تو می‌تونی دستشویی‌های جدید ثبت کنی، نظر بدی، امتیاز بدی، مشکل گزارش بدی و با ما این ربات رو دقیق‌تر، تمیزتر (!) و مفیدتر کنی 💪\n\n"
        "🚧 فعلاً ربات هنوز در حال توسعه‌ست و داریم کم‌کم بهترش می‌کنیم.\n"
        "پس اگه باگ، ایراد یا ایده‌ای داری، حتما بهمون بگو! (/feedback)\n\n"
        "مرسی که با ما هستی ❤️",
        parse_mode="Markdown"
    )
